/*
       给要隐藏的元素的父元素（box）添加onmouseover事件，
       当鼠标滑进就让他display：block，
       当鼠标划出就让他又隐藏起来

       同样的，三级菜单就给他的父元素（list）添加事件
   */

function selectbox() {
    //获取节点
    var box = document.getElementById('box');
    var menu1 = document.getElementById('menu1');
    var menu2 = document.getElementById('menu2');
    var list = document.getElementById('list');
    var aLis = document.querySelectorAll('#list dd');

    //二级导航出现
    box.onmouseover = function () {
        menu1.style.display = 'block';
    }

    //二级导航隐藏
    box.onmouseout = function () {
        menu1.style.display = 'none';
    }

    //三级导航显示
    list.onmouseover = function () {
        menu2.style.display = 'block';
    }

    //三级导航隐藏
    list.onmouseout = function () {
        menu2.style.display = 'none';
    }

    //划过每个li显示指定的内容
    let arr1 = [
        [
            ['鱼类', '三文鱼', '鳕鱼', '带鱼', '黄鱼/黄花鱼', '金枪鱼', '巴沙鱼', '鲳鱼', '鲈鱼', '鳗鱼', '鲽鱼', '胖头鱼', '更多'],
            ['虾类', '红虾', '白虾', '虾仁', '北极甜虾', '黑虎虾', '大龙虾', '小龙虾', '竹节虾', '皮皮虾', '基围虾', '更多'],
            ['蟹类', '大闸蟹', '帝王蟹', '梭子蟹', '面包蟹/黄金蟹', '青蟹', '雪蟹', '珍宝蟹', '红毛蟹', '醉蟹', '香辣蟹', '更多'],
            ['贝类', '生蚝', '鲍鱼', '扇贝', '蛤/蚬子', '螺', '蛏子', '北极贝', '蚌', '贝柱', '更多'],
            ['海参', '即食海参', '淡干海参', '速发海参', '冻干海参', '蒸食海参', '盐渍海参', '调味海参', '辽参', '特级海参', '更多'],
            ['海产干货', '干贝', '墨鱼干', '鱿鱼干', '虾皮', '海带', '海蛎干', '花胶', '银鱼干', '蛤蜊干', '海参', '更多'],
            ['知名品牌', '大洋世家', '獐子岛', '禧美', '三都港', '晓芹', '海晏堂'],
            ['地标产品', '阿根廷红虾', '厄瓜多尔白虾', '舟山带鱼', '查干湖鱼', '丹东蚬子', '福建鲍鱼', '宁波醉泥螺', '阳澄湖大闸蟹'],
            ['特色海产', '海外直采', '活鲜', '鱿鱼', '墨鱼', '甲鱼', '章鱼', '笔管鱼', '鳄鱼肉', '娃娃鱼', '海鲜方便菜', '麻辣海鲜', '八爪鱼']
        ],
        [
            ['猪肉', '肋排', '猪蹄', '五花肉', '汤骨/棒骨', '猪肘', '梅花肉片', '猪排/猪扒', '里脊', '猪腿肉', '猪肉馅', '脊骨', '更多'],
            ['牛肉', '牛排', '牛腩', '牛腱子', '牛里脊', '牛肉片/卷', '牛尾', '牛肋条', '牛蹄筋', '牛肉串', '牛骨', '筋头巴脑', '更多'],
            ['羊肉', '羊肋排', '羊肉片/卷', '羊腿', '羊蝎子', '羊肉块', '羊肉串', '整羊', '羊杂', '西式羊排', '羊肉馅', '更多'],
            ['鸡肉', '鸡翅', '整鸡', '鸡胸肉', '鸡腿', '鸡爪', '鸡肉块', '鸡胗/鸡肫', '鸡柳', '鸡排', '柴鸡', '老母鸡', '大公鸡', '更多'],
            ['鸭肉', '鸭腿', '鸭胸', '鸭胗/鸭肫', '鸭掌', '鸭脖', '鸭舌', '鸭翅', '老鸭', '更多'],
            ['地标产品', '内蒙古牛羊肉', '宁夏羊肉', '北京油鸡', '台湾烤肠', '宣威火腿', '哈尔滨红肠'],
            ['知名品牌', '双汇', '泰森', '科尔沁', '蒙都', '精气神', '百年栗园', '恒都', '蒙羊'],
            ['安心工艺', '原切肉', '调理肉', '冷鲜肉', '冷藏熟食', '有机肉'],
            ['新奇特', '鹅肉', '鸽肉', '知了', '猴蚕', '蛹', '鹿肉', '火鸡', '年肉礼盒', '野鸡'],
            ['内脏类', '肝', '肺', '肠', '肚', '心', '腰子', '鞭宝', '更多']
        ],
        [
            ['鱼类', '三文鱼', '鳕鱼', '带鱼', '黄鱼/黄花鱼', '金枪鱼', '巴沙鱼', '鲳鱼', '鲈鱼', '鳗鱼', '鲽鱼', '胖头鱼', '更多'],
            ['虾类', '红虾', '白虾', '虾仁', '北极甜虾', '黑虎虾', '大龙虾', '小龙虾', '竹节虾', '皮皮虾', '基围虾', '更多'],
            ['蟹类', '大闸蟹', '帝王蟹', '梭子蟹', '面包蟹/黄金蟹', '青蟹', '雪蟹', '珍宝蟹', '红毛蟹', '醉蟹', '香辣蟹', '更多'],
            ['贝类', '生蚝', '鲍鱼', '扇贝', '蛤/蚬子', '螺', '蛏子', '北极贝', '蚌', '贝柱', '更多'],
            ['海参', '即食海参', '淡干海参', '速发海参', '冻干海参', '蒸食海参', '盐渍海参', '调味海参', '辽参', '特级海参', '更多'],
            ['海产干货', '干贝', '墨鱼干', '鱿鱼干', '虾皮', '海带', '海蛎干', '花胶', '银鱼干', '蛤蜊干', '海参', '更多'],
            ['知名品牌', '大洋世家', '獐子岛', '禧美', '三都港', '晓芹', '海晏堂'],
            ['地标产品', '阿根廷红虾', '厄瓜多尔白虾', '舟山带鱼', '查干湖鱼', '丹东蚬子', '福建鲍鱼', '宁波醉泥螺', '阳澄湖大闸蟹'],
            ['特色海产', '海外直采', '活鲜', '鱿鱼', '墨鱼', '甲鱼', '章鱼', '笔管鱼', '鳄鱼肉', '娃娃鱼', '海鲜方便菜', '麻辣海鲜', '八爪鱼']
        ],
        [
            ['面点', '手抓饼', '水饺', '云吞', '汤圆/元宵', '包子', '面条', '馒头', '年糕', '月饼', '烧麦', '肠粉', '更多'],
            ['方便速食', '方便菜', '方便主食', '即食卤味', '培根', '火腿', '薯条', '鸡米花', '鸡肉块', '鸡柳', '更多'],
            ['饮品甜品', '冰激凌', '饮料', '果汁', '酸奶', '鲜奶', '乳酸菌', '蛋糕', '更多'],
            ['火锅丸料', '牛肉丸', '鱼豆腐', '鱼丸', '火锅肠', '墨鱼丸', '火锅饺', '包心丸', '方便火锅', '低温火锅料', '更多'],
            ['烘焙食材', '奶酪', '黄油', '芝士', '淡奶油', '蛋挞', '披萨', '早餐面包'],
            ['知名品牌', '船歌渔水饺', '正大食品', '湾仔码头', '思念', '三全', '广州酒家利口福', '天福号', '哈根达斯'],
            ['烧烤季', '羊肉', '牛肉', '鸡肉', '猪肉', '鸽肉/蚕蛹', '海鲜', '蔬菜', '主食'],
            ['舌尖美食', '船歌鱼水饺', '东北酸菜', '串串香', '松茸', '石屏豆腐', '冬笋'],
            ['方便菜单', '鱼香肉丝', '宫保鸡丁', '佛跳墙', '红烧肉', '小南国', '湘鄂情', '新雅大厨', '福成鲜到家'],

        ],
        [
            ['鱼类', '三文鱼', '鳕鱼', '带鱼', '黄鱼/黄花鱼', '金枪鱼', '巴沙鱼', '鲳鱼', '鲈鱼', '鳗鱼', '鲽鱼', '胖头鱼', '更多'],
            ['虾类', '红虾', '白虾', '虾仁', '北极甜虾', '黑虎虾', '大龙虾', '小龙虾', '竹节虾', '皮皮虾', '基围虾', '更多'],
            ['蟹类', '大闸蟹', '帝王蟹', '梭子蟹', '面包蟹/黄金蟹', '青蟹', '雪蟹', '珍宝蟹', '红毛蟹', '醉蟹', '香辣蟹', '更多'],
            ['贝类', '生蚝', '鲍鱼', '扇贝', '蛤/蚬子', '螺', '蛏子', '北极贝', '蚌', '贝柱', '更多'],
            ['海参', '即食海参', '淡干海参', '速发海参', '冻干海参', '蒸食海参', '盐渍海参', '调味海参', '辽参', '特级海参', '更多'],
            ['海产干货', '干贝', '墨鱼干', '鱿鱼干', '虾皮', '海带', '海蛎干', '花胶', '银鱼干', '蛤蜊干', '海参', '更多'],
            ['知名品牌', '大洋世家', '獐子岛', '禧美', '三都港', '晓芹', '海晏堂'],
            ['地标产品', '阿根廷红虾', '厄瓜多尔白虾', '舟山带鱼', '查干湖鱼', '丹东蚬子', '福建鲍鱼', '宁波醉泥螺', '阳澄湖大闸蟹'],
            ['特色海产', '海外直采', '活鲜', '鱿鱼', '墨鱼', '甲鱼', '章鱼', '笔管鱼', '鳄鱼肉', '娃娃鱼', '海鲜方便菜', '麻辣海鲜', '八爪鱼']
        ],
        [
            ['猪肉', '肋排', '猪蹄', '五花肉', '汤骨/棒骨', '猪肘', '梅花肉片', '猪排/猪扒', '里脊', '猪腿肉', '猪肉馅', '脊骨', '更多'],
            ['牛肉', '牛排', '牛腩', '牛腱子', '牛里脊', '牛肉片/卷', '牛尾', '牛肋条', '牛蹄筋', '牛肉串', '牛骨', '筋头巴脑', '更多'],
            ['羊肉', '羊肋排', '羊肉片/卷', '羊腿', '羊蝎子', '羊肉块', '羊肉串', '整羊', '羊杂', '西式羊排', '羊肉馅', '更多'],
            ['鸡肉', '鸡翅', '整鸡', '鸡胸肉', '鸡腿', '鸡爪', '鸡肉块', '鸡胗/鸡肫', '鸡柳', '鸡排', '柴鸡', '老母鸡', '大公鸡', '更多'],
            ['鸭肉', '鸭腿', '鸭胸', '鸭胗/鸭肫', '鸭掌', '鸭脖', '鸭舌', '鸭翅', '老鸭', '更多'],
            ['地标产品', '内蒙古牛羊肉', '宁夏羊肉', '北京油鸡', '台湾烤肠', '宣威火腿', '哈尔滨红肠'],
            ['知名品牌', '双汇', '泰森', '科尔沁', '蒙都', '精气神', '百年栗园', '恒都', '蒙羊'],
            ['安心工艺', '原切肉', '调理肉', '冷鲜肉', '冷藏熟食', '有机肉'],
            ['新奇特', '鹅肉', '鸽肉', '知了', '猴蚕', '蛹', '鹿肉', '火鸡', '年肉礼盒', '野鸡'],
            ['内脏类', '肝', '肺', '肠', '肚', '心', '腰子', '鞭宝', '更多']
        ],
        [
            ['鱼类', '三文鱼', '鳕鱼', '带鱼', '黄鱼/黄花鱼', '金枪鱼', '巴沙鱼', '鲳鱼', '鲈鱼', '鳗鱼', '鲽鱼', '胖头鱼', '更多'],
            ['虾类', '红虾', '白虾', '虾仁', '北极甜虾', '黑虎虾', '大龙虾', '小龙虾', '竹节虾', '皮皮虾', '基围虾', '更多'],
            ['蟹类', '大闸蟹', '帝王蟹', '梭子蟹', '面包蟹/黄金蟹', '青蟹', '雪蟹', '珍宝蟹', '红毛蟹', '醉蟹', '香辣蟹', '更多'],
            ['贝类', '生蚝', '鲍鱼', '扇贝', '蛤/蚬子', '螺', '蛏子', '北极贝', '蚌', '贝柱', '更多'],
            ['海参', '即食海参', '淡干海参', '速发海参', '冻干海参', '蒸食海参', '盐渍海参', '调味海参', '辽参', '特级海参', '更多'],
            ['海产干货', '干贝', '墨鱼干', '鱿鱼干', '虾皮', '海带', '海蛎干', '花胶', '银鱼干', '蛤蜊干', '海参', '更多'],
            ['知名品牌', '大洋世家', '獐子岛', '禧美', '三都港', '晓芹', '海晏堂'],
            ['地标产品', '阿根廷红虾', '厄瓜多尔白虾', '舟山带鱼', '查干湖鱼', '丹东蚬子', '福建鲍鱼', '宁波醉泥螺', '阳澄湖大闸蟹'],
            ['特色海产', '海外直采', '活鲜', '鱿鱼', '墨鱼', '甲鱼', '章鱼', '笔管鱼', '鳄鱼肉', '娃娃鱼', '海鲜方便菜', '麻辣海鲜', '八爪鱼']
        ],
        [
            ['面点', '手抓饼', '水饺', '云吞', '汤圆/元宵', '包子', '面条', '馒头', '年糕', '月饼', '烧麦', '肠粉', '更多'],
            ['方便速食', '方便菜', '方便主食', '即食卤味', '培根', '火腿', '薯条', '鸡米花', '鸡肉块', '鸡柳', '更多'],
            ['饮品甜品', '冰激凌', '饮料', '果汁', '酸奶', '鲜奶', '乳酸菌', '蛋糕', '更多'],
            ['火锅丸料', '牛肉丸', '鱼豆腐', '鱼丸', '火锅肠', '墨鱼丸', '火锅饺', '包心丸', '方便火锅', '低温火锅料', '更多'],
            ['烘焙食材', '奶酪', '黄油', '芝士', '淡奶油', '蛋挞', '披萨', '早餐面包'],
            ['知名品牌', '船歌渔水饺', '正大食品', '湾仔码头', '思念', '三全', '广州酒家利口福', '天福号', '哈根达斯'],
            ['烧烤季', '羊肉', '牛肉', '鸡肉', '猪肉', '鸽肉/蚕蛹', '海鲜', '蔬菜', '主食'],
            ['舌尖美食', '船歌鱼水饺', '东北酸菜', '串串香', '松茸', '石屏豆腐', '冬笋'],
            ['方便菜单', '鱼香肉丝', '宫保鸡丁', '佛跳墙', '红烧肉', '小南国', '湘鄂情', '新雅大厨', '福成鲜到家'],

        ], [
            ['鱼类', '三文鱼', '鳕鱼', '带鱼', '黄鱼/黄花鱼', '金枪鱼', '巴沙鱼', '鲳鱼', '鲈鱼', '鳗鱼', '鲽鱼', '胖头鱼', '更多'],
            ['虾类', '红虾', '白虾', '虾仁', '北极甜虾', '黑虎虾', '大龙虾', '小龙虾', '竹节虾', '皮皮虾', '基围虾', '更多'],
            ['蟹类', '大闸蟹', '帝王蟹', '梭子蟹', '面包蟹/黄金蟹', '青蟹', '雪蟹', '珍宝蟹', '红毛蟹', '醉蟹', '香辣蟹', '更多'],
            ['贝类', '生蚝', '鲍鱼', '扇贝', '蛤/蚬子', '螺', '蛏子', '北极贝', '蚌', '贝柱', '更多'],
            ['海参', '即食海参', '淡干海参', '速发海参', '冻干海参', '蒸食海参', '盐渍海参', '调味海参', '辽参', '特级海参', '更多'],
            ['海产干货', '干贝', '墨鱼干', '鱿鱼干', '虾皮', '海带', '海蛎干', '花胶', '银鱼干', '蛤蜊干', '海参', '更多'],
            ['知名品牌', '大洋世家', '獐子岛', '禧美', '三都港', '晓芹', '海晏堂'],
            ['地标产品', '阿根廷红虾', '厄瓜多尔白虾', '舟山带鱼', '查干湖鱼', '丹东蚬子', '福建鲍鱼', '宁波醉泥螺', '阳澄湖大闸蟹'],
            ['特色海产', '海外直采', '活鲜', '鱿鱼', '墨鱼', '甲鱼', '章鱼', '笔管鱼', '鳄鱼肉', '娃娃鱼', '海鲜方便菜', '麻辣海鲜', '八爪鱼']
        ],
        [
            ['猪肉', '肋排', '猪蹄', '五花肉', '汤骨/棒骨', '猪肘', '梅花肉片', '猪排/猪扒', '里脊', '猪腿肉', '猪肉馅', '脊骨', '更多'],
            ['牛肉', '牛排', '牛腩', '牛腱子', '牛里脊', '牛肉片/卷', '牛尾', '牛肋条', '牛蹄筋', '牛肉串', '牛骨', '筋头巴脑', '更多'],
            ['羊肉', '羊肋排', '羊肉片/卷', '羊腿', '羊蝎子', '羊肉块', '羊肉串', '整羊', '羊杂', '西式羊排', '羊肉馅', '更多'],
            ['鸡肉', '鸡翅', '整鸡', '鸡胸肉', '鸡腿', '鸡爪', '鸡肉块', '鸡胗/鸡肫', '鸡柳', '鸡排', '柴鸡', '老母鸡', '大公鸡', '更多'],
            ['鸭肉', '鸭腿', '鸭胸', '鸭胗/鸭肫', '鸭掌', '鸭脖', '鸭舌', '鸭翅', '老鸭', '更多'],
            ['地标产品', '内蒙古牛羊肉', '宁夏羊肉', '北京油鸡', '台湾烤肠', '宣威火腿', '哈尔滨红肠'],
            ['知名品牌', '双汇', '泰森', '科尔沁', '蒙都', '精气神', '百年栗园', '恒都', '蒙羊'],
            ['安心工艺', '原切肉', '调理肉', '冷鲜肉', '冷藏熟食', '有机肉'],
            ['新奇特', '鹅肉', '鸽肉', '知了', '猴蚕', '蛹', '鹿肉', '火鸡', '年肉礼盒', '野鸡'],
            ['内脏类', '肝', '肺', '肠', '肚', '心', '腰子', '鞭宝', '更多']
        ],
        [
            ['鱼类', '三文鱼', '鳕鱼', '带鱼', '黄鱼/黄花鱼', '金枪鱼', '巴沙鱼', '鲳鱼', '鲈鱼', '鳗鱼', '鲽鱼', '胖头鱼', '更多'],
            ['虾类', '红虾', '白虾', '虾仁', '北极甜虾', '黑虎虾', '大龙虾', '小龙虾', '竹节虾', '皮皮虾', '基围虾', '更多'],
            ['蟹类', '大闸蟹', '帝王蟹', '梭子蟹', '面包蟹/黄金蟹', '青蟹', '雪蟹', '珍宝蟹', '红毛蟹', '醉蟹', '香辣蟹', '更多'],
            ['贝类', '生蚝', '鲍鱼', '扇贝', '蛤/蚬子', '螺', '蛏子', '北极贝', '蚌', '贝柱', '更多'],
            ['海参', '即食海参', '淡干海参', '速发海参', '冻干海参', '蒸食海参', '盐渍海参', '调味海参', '辽参', '特级海参', '更多'],
            ['海产干货', '干贝', '墨鱼干', '鱿鱼干', '虾皮', '海带', '海蛎干', '花胶', '银鱼干', '蛤蜊干', '海参', '更多'],
            ['知名品牌', '大洋世家', '獐子岛', '禧美', '三都港', '晓芹', '海晏堂'],
            ['地标产品', '阿根廷红虾', '厄瓜多尔白虾', '舟山带鱼', '查干湖鱼', '丹东蚬子', '福建鲍鱼', '宁波醉泥螺', '阳澄湖大闸蟹'],
            ['特色海产', '海外直采', '活鲜', '鱿鱼', '墨鱼', '甲鱼', '章鱼', '笔管鱼', '鳄鱼肉', '娃娃鱼', '海鲜方便菜', '麻辣海鲜', '八爪鱼']
        ],
        [
            ['面点', '手抓饼', '水饺', '云吞', '汤圆/元宵', '包子', '面条', '馒头', '年糕', '月饼', '烧麦', '肠粉', '更多'],
            ['方便速食', '方便菜', '方便主食', '即食卤味', '培根', '火腿', '薯条', '鸡米花', '鸡肉块', '鸡柳', '更多'],
            ['饮品甜品', '冰激凌', '饮料', '果汁', '酸奶', '鲜奶', '乳酸菌', '蛋糕', '更多'],
            ['火锅丸料', '牛肉丸', '鱼豆腐', '鱼丸', '火锅肠', '墨鱼丸', '火锅饺', '包心丸', '方便火锅', '低温火锅料', '更多'],
            ['烘焙食材', '奶酪', '黄油', '芝士', '淡奶油', '蛋挞', '披萨', '早餐面包'],
            ['知名品牌', '船歌渔水饺', '正大食品', '湾仔码头', '思念', '三全', '广州酒家利口福', '天福号', '哈根达斯'],
            ['烧烤季', '羊肉', '牛肉', '鸡肉', '猪肉', '鸽肉/蚕蛹', '海鲜', '蔬菜', '主食'],
            ['舌尖美食', '船歌鱼水饺', '东北酸菜', '串串香', '松茸', '石屏豆腐', '冬笋'],
            ['方便菜单', '鱼香肉丝', '宫保鸡丁', '佛跳墙', '红烧肉', '小南国', '湘鄂情', '新雅大厨', '福成鲜到家'],

        ], [
            ['鱼类', '三文鱼', '鳕鱼', '带鱼', '黄鱼/黄花鱼', '金枪鱼', '巴沙鱼', '鲳鱼', '鲈鱼', '鳗鱼', '鲽鱼', '胖头鱼', '更多'],
            ['虾类', '红虾', '白虾', '虾仁', '北极甜虾', '黑虎虾', '大龙虾', '小龙虾', '竹节虾', '皮皮虾', '基围虾', '更多'],
            ['蟹类', '大闸蟹', '帝王蟹', '梭子蟹', '面包蟹/黄金蟹', '青蟹', '雪蟹', '珍宝蟹', '红毛蟹', '醉蟹', '香辣蟹', '更多'],
            ['贝类', '生蚝', '鲍鱼', '扇贝', '蛤/蚬子', '螺', '蛏子', '北极贝', '蚌', '贝柱', '更多'],
            ['海参', '即食海参', '淡干海参', '速发海参', '冻干海参', '蒸食海参', '盐渍海参', '调味海参', '辽参', '特级海参', '更多'],
            ['海产干货', '干贝', '墨鱼干', '鱿鱼干', '虾皮', '海带', '海蛎干', '花胶', '银鱼干', '蛤蜊干', '海参', '更多'],
            ['知名品牌', '大洋世家', '獐子岛', '禧美', '三都港', '晓芹', '海晏堂'],
            ['地标产品', '阿根廷红虾', '厄瓜多尔白虾', '舟山带鱼', '查干湖鱼', '丹东蚬子', '福建鲍鱼', '宁波醉泥螺', '阳澄湖大闸蟹'],
            ['特色海产', '海外直采', '活鲜', '鱿鱼', '墨鱼', '甲鱼', '章鱼', '笔管鱼', '鳄鱼肉', '娃娃鱼', '海鲜方便菜', '麻辣海鲜', '八爪鱼']
        ],
        [
            ['猪肉', '肋排', '猪蹄', '五花肉', '汤骨/棒骨', '猪肘', '梅花肉片', '猪排/猪扒', '里脊', '猪腿肉', '猪肉馅', '脊骨', '更多'],
            ['牛肉', '牛排', '牛腩', '牛腱子', '牛里脊', '牛肉片/卷', '牛尾', '牛肋条', '牛蹄筋', '牛肉串', '牛骨', '筋头巴脑', '更多'],
            ['羊肉', '羊肋排', '羊肉片/卷', '羊腿', '羊蝎子', '羊肉块', '羊肉串', '整羊', '羊杂', '西式羊排', '羊肉馅', '更多'],
            ['鸡肉', '鸡翅', '整鸡', '鸡胸肉', '鸡腿', '鸡爪', '鸡肉块', '鸡胗/鸡肫', '鸡柳', '鸡排', '柴鸡', '老母鸡', '大公鸡', '更多'],
            ['鸭肉', '鸭腿', '鸭胸', '鸭胗/鸭肫', '鸭掌', '鸭脖', '鸭舌', '鸭翅', '老鸭', '更多'],
            ['地标产品', '内蒙古牛羊肉', '宁夏羊肉', '北京油鸡', '台湾烤肠', '宣威火腿', '哈尔滨红肠'],
            ['知名品牌', '双汇', '泰森', '科尔沁', '蒙都', '精气神', '百年栗园', '恒都', '蒙羊'],
            ['安心工艺', '原切肉', '调理肉', '冷鲜肉', '冷藏熟食', '有机肉'],
            ['新奇特', '鹅肉', '鸽肉', '知了', '猴蚕', '蛹', '鹿肉', '火鸡', '年肉礼盒', '野鸡'],
            ['内脏类', '肝', '肺', '肠', '肚', '心', '腰子', '鞭宝', '更多']
        ],
        [
            ['鱼类', '三文鱼', '鳕鱼', '带鱼', '黄鱼/黄花鱼', '金枪鱼', '巴沙鱼', '鲳鱼', '鲈鱼', '鳗鱼', '鲽鱼', '胖头鱼', '更多'],
            ['虾类', '红虾', '白虾', '虾仁', '北极甜虾', '黑虎虾', '大龙虾', '小龙虾', '竹节虾', '皮皮虾', '基围虾', '更多'],
            ['蟹类', '大闸蟹', '帝王蟹', '梭子蟹', '面包蟹/黄金蟹', '青蟹', '雪蟹', '珍宝蟹', '红毛蟹', '醉蟹', '香辣蟹', '更多'],
            ['贝类', '生蚝', '鲍鱼', '扇贝', '蛤/蚬子', '螺', '蛏子', '北极贝', '蚌', '贝柱', '更多'],
            ['海参', '即食海参', '淡干海参', '速发海参', '冻干海参', '蒸食海参', '盐渍海参', '调味海参', '辽参', '特级海参', '更多'],
            ['海产干货', '干贝', '墨鱼干', '鱿鱼干', '虾皮', '海带', '海蛎干', '花胶', '银鱼干', '蛤蜊干', '海参', '更多'],
            ['知名品牌', '大洋世家', '獐子岛', '禧美', '三都港', '晓芹', '海晏堂'],
            ['地标产品', '阿根廷红虾', '厄瓜多尔白虾', '舟山带鱼', '查干湖鱼', '丹东蚬子', '福建鲍鱼', '宁波醉泥螺', '阳澄湖大闸蟹'],
            ['特色海产', '海外直采', '活鲜', '鱿鱼', '墨鱼', '甲鱼', '章鱼', '笔管鱼', '鳄鱼肉', '娃娃鱼', '海鲜方便菜', '麻辣海鲜', '八爪鱼']
        ],
        [
            ['面点', '手抓饼', '水饺', '云吞', '汤圆/元宵', '包子', '面条', '馒头', '年糕', '月饼', '烧麦', '肠粉', '更多'],
            ['方便速食', '方便菜', '方便主食', '即食卤味', '培根', '火腿', '薯条', '鸡米花', '鸡肉块', '鸡柳', '更多'],
            ['饮品甜品', '冰激凌', '饮料', '果汁', '酸奶', '鲜奶', '乳酸菌', '蛋糕', '更多'],
            ['火锅丸料', '牛肉丸', '鱼豆腐', '鱼丸', '火锅肠', '墨鱼丸', '火锅饺', '包心丸', '方便火锅', '低温火锅料', '更多'],
            ['烘焙食材', '奶酪', '黄油', '芝士', '淡奶油', '蛋挞', '披萨', '早餐面包'],
            ['知名品牌', '船歌渔水饺', '正大食品', '湾仔码头', '思念', '三全', '广州酒家利口福', '天福号', '哈根达斯'],
            ['烧烤季', '羊肉', '牛肉', '鸡肉', '猪肉', '鸽肉/蚕蛹', '海鲜', '蔬菜', '主食'],
            ['舌尖美食', '船歌鱼水饺', '东北酸菜', '串串香', '松茸', '石屏豆腐', '冬笋'],
            ['方便菜单', '鱼香肉丝', '宫保鸡丁', '佛跳墙', '红烧肉', '小南国', '湘鄂情', '新雅大厨', '福成鲜到家'],

        ],
        [
            ['鱼类', '三文鱼', '鳕鱼', '带鱼', '黄鱼/黄花鱼', '金枪鱼', '巴沙鱼', '鲳鱼', '鲈鱼', '鳗鱼', '鲽鱼', '胖头鱼', '更多'],
            ['虾类', '红虾', '白虾', '虾仁', '北极甜虾', '黑虎虾', '大龙虾', '小龙虾', '竹节虾', '皮皮虾', '基围虾', '更多'],
            ['蟹类', '大闸蟹', '帝王蟹', '梭子蟹', '面包蟹/黄金蟹', '青蟹', '雪蟹', '珍宝蟹', '红毛蟹', '醉蟹', '香辣蟹', '更多'],
            ['贝类', '生蚝', '鲍鱼', '扇贝', '蛤/蚬子', '螺', '蛏子', '北极贝', '蚌', '贝柱', '更多'],
            ['海参', '即食海参', '淡干海参', '速发海参', '冻干海参', '蒸食海参', '盐渍海参', '调味海参', '辽参', '特级海参', '更多'],
            ['海产干货', '干贝', '墨鱼干', '鱿鱼干', '虾皮', '海带', '海蛎干', '花胶', '银鱼干', '蛤蜊干', '海参', '更多'],
            ['知名品牌', '大洋世家', '獐子岛', '禧美', '三都港', '晓芹', '海晏堂'],
            ['地标产品', '阿根廷红虾', '厄瓜多尔白虾', '舟山带鱼', '查干湖鱼', '丹东蚬子', '福建鲍鱼', '宁波醉泥螺', '阳澄湖大闸蟹'],
            ['特色海产', '海外直采', '活鲜', '鱿鱼', '墨鱼', '甲鱼', '章鱼', '笔管鱼', '鳄鱼肉', '娃娃鱼', '海鲜方便菜', '麻辣海鲜', '八爪鱼']
        ],
        [
            ['猪肉', '肋排', '猪蹄', '五花肉', '汤骨/棒骨', '猪肘', '梅花肉片', '猪排/猪扒', '里脊', '猪腿肉', '猪肉馅', '脊骨', '更多'],
            ['牛肉', '牛排', '牛腩', '牛腱子', '牛里脊', '牛肉片/卷', '牛尾', '牛肋条', '牛蹄筋', '牛肉串', '牛骨', '筋头巴脑', '更多'],
            ['羊肉', '羊肋排', '羊肉片/卷', '羊腿', '羊蝎子', '羊肉块', '羊肉串', '整羊', '羊杂', '西式羊排', '羊肉馅', '更多'],
            ['鸡肉', '鸡翅', '整鸡', '鸡胸肉', '鸡腿', '鸡爪', '鸡肉块', '鸡胗/鸡肫', '鸡柳', '鸡排', '柴鸡', '老母鸡', '大公鸡', '更多'],
            ['鸭肉', '鸭腿', '鸭胸', '鸭胗/鸭肫', '鸭掌', '鸭脖', '鸭舌', '鸭翅', '老鸭', '更多'],
            ['地标产品', '内蒙古牛羊肉', '宁夏羊肉', '北京油鸡', '台湾烤肠', '宣威火腿', '哈尔滨红肠'],
            ['知名品牌', '双汇', '泰森', '科尔沁', '蒙都', '精气神', '百年栗园', '恒都', '蒙羊'],
            ['安心工艺', '原切肉', '调理肉', '冷鲜肉', '冷藏熟食', '有机肉'],
            ['新奇特', '鹅肉', '鸽肉', '知了', '猴蚕', '蛹', '鹿肉', '火鸡', '年肉礼盒', '野鸡'],
            ['内脏类', '肝', '肺', '肠', '肚', '心', '腰子', '鞭宝', '更多']
        ]
    ];

    $('#box #menu1').mouseover(function () {
        $('#box #menu2').css('display', 'block');
    }).on('mouseover', '#list dd', function () {
        let index = $(this).index();
        // console.log(index);
        let html1 = arr1[index].map(item1 => {
            let html2 = item1.map(item2 => {
                return `| <i>${item2}</i> `;
            }).join('');
            return `<div>
                        <p>${item1[0]} ></p>
                        <p> ${html2} </p>
                    </div>`;
        }).join('');
        // console.log(html1);
        $('#box #menu2').html(html1);
    }).mouseout(() => {
        $('#box #menu2').css('display', 'none');
    });

}